/*====================================================
*文件名:EPWM.c
*功能:控制PWM输出
====================================================*/
#include "syscfg.h"
#include "MS82Fxx02.h"
#include "sysdef.h"
/*====================================================
*函数名:SET_EPWM_INIT
*功能:CCP1模块开启PWM半桥输出,占空比50%,频率为10KHz,带死区
*输入参数:无
*返回参数:无
====================================================*/
void SET_EPWM_INIT(void)
{
	TRISC |= 0b00001000;
	MSCKCON |= 0b00100000;
	PR2 = 63;
	EPWMR1L = 0;
	EPWM1CON = 0b10001100; //PWM模式,半桥输出
	TMR2IF = 0;
	T2CON = 0B00000100;
	while(TMR2IF==0) CLRWDT();
	PWM1CON = 0b00000000; 
	EPWM1AUX = 0b10000100;
	TRISC &= 0b11110111;
}
	/***************************
	PWM周期:(PR2+1)*4*Tosc*(Timer2预分频值)
	Tosc=(1/4MHz)=0.25us
	Timer2预分频值为1:1
	所以周期等于(99+1)*4*0.25us*1=100us=10KHz

	占空比:(EPWMR1L:EPWM1CON[5:4])/(4*(PR2+1))
	(EPWMR1L:EPWM1CON[5:4])=200
	所以占空比=200/(4*(99+1))=50%

	要改变占空比,只需修改EPWM1CON[5:4]和EPWMR1L

	此例程开启了PWM辅助功能,即EPWM1AUX寄存器的BIT7置1
	开启了次功能后,可以任意开启和关闭P1C/P1D/P1E/P1F

	PWM1CON寄存器Bit6~Bit0是设置死区大小
	死区大小计算:指令周期*EPWM1CON[6:0]
	此例程指令周期=(1/4MHz)*2T=0.5us
	EPWM1CON[6:0]=0b010000=16
	所以死区大小=0.5us*16=8us
	***************************/
/*====================================================
*函数名:SET_EPWM_TO
*功能:改变PWM端口的占空比输出
*输入参数:per占空比(0~255)
*返回参数:无
====================================================*/
void SET_EPWM_TO(unsigned char per)
{

	EPWMR1L = per>>2;
	EPWM1CON = 0b10001100|((per&0b00000011)<<4);

}

/*====================================================
*函数名:SET_EPWM_OFF
*功能:停止PWM输出
*输入参数:无
*返回参数:无
====================================================*/
void SET_EPWM_OFF(void)
{

	EPWMAS |= 0xF0;

}

/*====================================================
*函数名:SET_EPWM_ON
*功能:停止PWM输出
*输入参数:无
*返回参数:无
====================================================*/
void SET_EPWM_ON(void)
{

	EPWMAS &= 0x00;

}